# 6 Sense Data Visualization

In [72]:
# Importing Data Science Libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import itertools
%matplotlib inline
# from sklearn.model_selection import train_test_split,cross_val_score,KFold,cross_val_predict
# from sklearn.metrics import accuracy_score, classification_report, precision_score, recall_score,confusion_matrix,precision_recall_curve,roc_curve
# from sklearn.feature_selection import RFE
# from sklearn.linear_model import LogisticRegression
# from sklearn.ensemble import ExtraTreesClassifier,RandomForestClassifier,AdaBoostClassifier,GradientBoostingClassifier
# from sklearn.neighbors  import KNeighborsClassifier
# from sklearn import svm,tree

In [73]:
%ls

calls.csv                events.csv               project Files.docx
companies.csv            opportunities.csv
data_visulization.ipynb  people.csv

In [74]:
# extract to DataFrames
calls = pd.read_csv('calls.csv')
events = pd.read_csv('events.csv')
companies = pd.read_csv('companies.csv')
opportunities = pd.read_csv('opportunities.csv')
people = pd.read_csv('people.csv')
display(calls.head(), events.head(), companies.head(), opportunities.head(), people.head())

         date call_disposition           contact_id
0  2019-12-19        No Answer  3666095539141404028
1  2019-09-25        No Answer  3109965562170131229
2  2019-12-03     Wrong Number  3109965562170131229
3  2019-08-16        No Answer  3913023627211105357
4  2019-08-09        No Answer  8049928805488017579

,date,activity_action,activity_type,activity_name,contact_id
0,2019-06-26,view,known_web_visit,6sense.com/platform/,1386320599507460867
1,2019-09-05,view,known_web_visit,empowered-cmo-2019,7671991219540614395
2,2019-06-05,fill_out,form_fill,standard responsive form - webinar,4587949013131732047
3,2019-03-14,open,email_open,2019_03-webinar-siriusdecisions & quorum.03_in...,2855153075501693064
4,2019-03-04,open,email_open,2019_03-webinar-siriusdecisions & quorum.01_in...,1724007291850641594

        company_id                 industry employee_range
0  617006fc08f4546  Software and Technology  1,000 - 4,999
1  62d9d22e01ea8a0        Business Services      100 - 249
2  6500326ed9624ee  Software and Technology      250 - 499
3  667f9e9ab6d0490       Telecommunications      100 - 249
4  69eabbb824940d9  Software and Technology        50 - 99

        company_id created_date
0  18a5a778029d9a4   2019-05-10
1  ab992b5d89eae05   2019-11-13
2  4d01dfb0312d68a   2019-02-15
3  d4c3ac7dca86eef   2019-09-20
4  36d482e443e234f   2019-03-15

        job_level job_function       company_id           contact_id
0           Staff    Marketing  5ff5587036cec59  1946252076663643521
1         Manager    Marketing  96a801c9959eb6f  6873571737524164147
2         Manager    Marketing  5fbbb5d0353f920  7515219369116939560
3        Director    Marketing  06559a695c3cc41  2906865117826811134
4  Vice President    Marketing  cfa16f49d1de7c5  1720505383334354822

Files:
 - calls.csv: a timeline of outgoing sales calls and the disposition of those calls
 - events.csv: any activities that we have on record taking place before the phone calls were made
 - companies.csv: the industry and employee count of the companies
 - people.csv: the people who were called, along with their job level and function and the ID of the company they work for

## calls.csv

In [75]:
calls.head()

         date call_disposition           contact_id
0  2019-12-19        No Answer  3666095539141404028
1  2019-09-25        No Answer  3109965562170131229
2  2019-12-03     Wrong Number  3109965562170131229
3  2019-08-16        No Answer  3913023627211105357
4  2019-08-09        No Answer  8049928805488017579

In [76]:
calls.shape

(2764, 3)

In [77]:
calls.dtypes

date                object
call_disposition    object
contact_id           int64
dtype: object

In [78]:
calls.groupby('call_disposition').count()['date']

call_disposition
Busy                29
Connected          198
Left Voicemail    1010
No Answer         1189
Not in Service      95
Rejected            16
Wrong Number       227
Name: date, dtype: int64

In [79]:
# change the date from str to datetime
new_calls = calls.copy()
new_calls['date'] = pd.to_datetime(new_calls['date'], format='%Y-%m-%d')

In [83]:
import datetime
# weekdays as a tuple
weekDays = ("Monday","Tuesday","Wednesday","Thursday","Friday","Saturday","Sunday")

weekday = []
for i in new_calls['date']:
    weekday = np.append(weekday, weekDays[i.weekday()])
#make a new column 'weekday'
new_calls['weekday'] = weekday

In [98]:
new_calls.head()

        date call_disposition           contact_id    weekday
0 2019-12-19        No Answer  3666095539141404028   Thursday
1 2019-09-25        No Answer  3109965562170131229  Wednesday
2 2019-12-03     Wrong Number  3109965562170131229    Tuesday
3 2019-08-16        No Answer  3913023627211105357     Friday
4 2019-08-09        No Answer  8049928805488017579     Friday

In [99]:
new_calls.to_csv('new_calls.csv')

In [89]:
week_calls = new_calls.groupby(['call_disposition', 'weekday']).count()
week_calls.head()

                            date  contact_id
call_disposition weekday
Busy             Friday        2           2
                 Monday        3           3
                 Thursday      7           7
                 Tuesday       6           6
                 Wednesday    11          11

## Events.csv

In [102]:
# change the date from str to datetime
new_events = events.copy()
new_events['date'] = pd.to_datetime(new_events['date'], format='%Y-%m-%d')

In [103]:
import datetime
# weekdays as a tuple
weekDays = ("Monday","Tuesday","Wednesday","Thursday","Friday","Saturday","Sunday")

weekday = []
for i in new_events['date']:
    weekday = np.append(weekday, weekDays[i.weekday()])
#make a new column 'weekday'
new_events['weekday'] = weekday

In [104]:
new_events.head()

,date,activity_action,activity_type,activity_name,contact_id,weekday
0,2019-06-26,view,known_web_visit,6sense.com/platform/,1386320599507460867,Wednesday
1,2019-09-05,view,known_web_visit,empowered-cmo-2019,7671991219540614395,Thursday
2,2019-06-05,fill_out,form_fill,standard responsive form - webinar,4587949013131732047,Wednesday
3,2019-03-14,open,email_open,2019_03-webinar-siriusdecisions & quorum.03_in...,2855153075501693064,Thursday
4,2019-03-04,open,email_open,2019_03-webinar-siriusdecisions & quorum.01_in...,1724007291850641594,Monday

In [105]:
new_events.to_csv('new_events.csv')

In [112]:
#join table
all = people.merge(companies, how='inner', on = 'company_id')
all

,job_level,job_function,company_id,contact_id,industry,employee_range
0,Staff,Marketing,5ff5587036cec59,1946252076663643521,Business Services,500 - 999
1,Director,Marketing,5ff5587036cec59,7264206452326702796,Business Services,500 - 999
2,Manager,Marketing,96a801c9959eb6f,6873571737524164147,Software and Technology,250 - 499
3,Manager,Marketing,5fbbb5d0353f920,7515219369116939560,Software and Technology,250 - 499
4,Director,Marketing,06559a695c3cc41,2906865117826811134,Software and Technology,100 - 249
...,...,...,...,...,...,...
1830,Manager,Marketing,4cc72511c993028,1698116093950122465,Software and Technology,500 - 999
1831,Director,Marketing,82ee3252905e23e,576504958452349251,Financial Services,"10,000+"
1832,Vice President,Sales,dec011722127aaf,480220301571844221,Software and Technology,100 - 249
1833,Director,Sales,384ad2304de8f1c,4587949013131732047,Software and Technology,50 - 99
1834,Vice President,Business Development,4fd7d8ce6fc2001,120940203696901826,Software and Technology,"1,000 - 4,999"